close all;
clear all;
clc;


%%%%%%%%%%%%%%%%%%%%%%%%%%% 取整函数 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
x = 12.12;
floor(x);    %向下取整
ceil(x);     %向上取整
round(x);    %取最接近的整数
fix(x);      %向0取整

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  复数  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

z = 3 + 4*j;
real(z);  %返回复数z的实部
abs(z);   %返回z的模
conj(z);  %返回z的共轭
imag(z);  %返回z的虚部
angle(z); %返回z的幅角
complex(12, 23); %以a为实部，b为虚部创建复数

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  向量   %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


A = 1:9;
B = 10 - A;


%   &与   |或  ~非
(A  == B);  %判断A和 B 中的元素是否相等
(A > 2) & (A < 6);
%finite(Inf);   % 元素有限，返回真值
%Isempty();     % 参数为空，返回真值
%isglobal();    % 参数是一个全局变量，返回真值
%ishold();      % 当前绘图保持是“ON”,返回真值
%isieee();      % 计算机执行IEEE算术运算， 返回真值
isinf(Inf);       % 元素无穷大，返回真值
isletter('A');    %元素为字母，返回真值;
isnan(NaN);      %元素为不定制，返回真值
isreal(3 + 4*j);        %参数无虚部，，返回真值
%isspace()               %元素为空格字符，返回真值
%isstr();               %参数为一个字符串，返回真值
isunix();               %计算机为unix系统，返回真值


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  数组   %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Array = [1 2 3 4 5 6];
Array(1:4);

Array1 = 1:2:10;            %创建从1开始，2为步进，10结束的数组
Array2 = linspace(2,10,10); %在[2,10]上创建一个有10个元素的向量，这10个数把区间线性分隔。


%%%%%%%%%%%%%%%%%%%%%%%%%%%% 单元数组 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 单元数组是一种无所不包的广义矩阵，组成单元数组的每一个元素称为一个单元，每一个单元可以包括一个任意数组，如数值数组、
% 字符串数组，结构体数组或另外一个单元数组

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
C = {'x',[1;3;6];10,pi};
a = cell(2,2);
b = cell(1);

C1 = {3, [4 7;6 6;80 9], 'string'; sin(pi/8), 3>10, 'code'};
unit_Val1 = C1(2,2);      %指的是单元数组中第m行第n列的单元
class(unit_Val1);
unit_Val2 = C1{2,2};      %指的是单元数组中第m行第n列的单元中的内容
class(unit_Val2);

%%%%%%%%%%%%%%%%%%%%%%%%%%%% map容器 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%创建map对象
schedulemap = containers.Map({'Monday','Tuesday','Wednesday','Thursday','Friday'},{'Maths','chinese','history','Geography','Biology'});
%键
keys(schedulemap);
%值
values(schedulemap);
%读取map键值对
course = schedulemap('Wednesday');

%读取多个
values(schedulemap, {'Monday', 'Thursday'});

%删除
remove(schedulemap, 'Thursday');
%键
keys(schedulemap);
%值
values(schedulemap);


%添加
schedulemap('Saturday') = 'Public elective course'

%修改
schedulemap('Monday') = 'englist'

%%%%%%%%%%%%%%%%%%%%%%%%%%%% 基本矩阵操作 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%创建一个n x n的矩阵
ones(10);

%创建一个2 x 3  的矩阵
A = ones(2,3 );

%创建一个2 x 3 x 4的矩阵
ones(2,3,4);

%创建一个2 x 3 x 4 x 5的矩阵
ones(2,3,4,5);

%创建一个和矩阵A一样大小的矩阵
ones(size(A));

%创建一个m x n大小的单位矩阵
eye(3, 4);

%创建一个m大小的单位矩阵
eye(3);

eye(size(A));

%创建一个n x n的矩阵，其每一行每一列的元素之和都相等
magic(3);  

%创建一个元素为0~1之间均匀分布的随机数
rand(3);

rand(3,4)

%创建一个元素为0~1之间的均值为0，单位方差的正态分布随机数
randn(3)

%创建一个元素为0~1之间的均值为0，单位方差的正态分布随机数
A = randn(3,4)

%创建一个主对角线为x的矩阵，其他元素为0
diag([1,2,3,4])

%创建一个和A大小相同的上三角矩阵，该矩阵的主对角线以上的元素为A中相应的元素
triu(A)

%创建一个和A大小相同的下三角矩阵，该矩阵的主对角线以上的元素为A中相应的元素
tril(A)


%使用逗号建立二维矩阵
A = [2,3,5,8,9,11; 
     3,12,10,111,32,89;
     32,122,170,345,362,897
     ]
 M = 4
 N = 5
for i = 1:M
    for j = 1:N
        Mat(i,j) = (i-1)*N + j;
    end
end

%使用空格构造矩阵
B = [2 3 5;3 6 10]

V1= [8, 59, 60, 33]

V2 = [5;8;3;5;9]

[m,n] = size(A)

%矩阵每一行均进行逆序排列
fliplr(A)

%矩阵每一列均进行逆序排列
flipud(A)

%逆时针旋转90°
rot90(A)

%逆时针旋转2 x 90°
rot90(A,2)

reshape(A,n,m)


%对矩阵的每一列分别进行排序
sort(A)

%将二维数组重组为一维数组后返回数组的第4个元素
A(4)


%返回数组的第2列向量
A(:,2)

%返回数组的第2行向量
A(2,:)

Mat(2:4,2:5)
Mat(2,:)
Mat(:,3)
Mat([1,4,6,10])
Mat(:,[1,3])
Mat([1,3],:)


IND = sub2ind(size(Mat),2,3)

[I J] = ind2sub(size(Mat),10)

%求矩阵的第二列的和
sum(A(:,2))

%求矩阵的最后一列的和
sum(A(:,end))


%获取矩阵的维数
ndims(A)

%获取矩阵的元素个数
numel(A)

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%检查矩阵的元素类型
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%检查矩阵元素是否为数值型变量
isnumeric(A)

%检查矩阵元素是否为实数数值型变量
isreal(A)


%检查矩阵元素是否为数值型变量
isfloat(A)


%检查矩阵元素是否为数值型变量
isinteger(A)


%检查矩阵元素是否为数值型变量
islogical(A)


%检查矩阵元素是否为数值型变量
ischar(A)


%检查矩阵元素是否为数值型变量
isstruct(A)


%检查矩阵元素是否为数值型变量
iscell(A)


%检查矩阵元素是否为数值型变量
iscellstr(A)

%矩阵元素赋值
A(1,2) = 777;

A(4,:) = 3


%矩阵加减乘除
A1 = [2 0 -1;
    1 3 2];

B1 = [1 7 -1;
    4 2 3;
    2 0 1];

C1 = [1 0 1 0;
    -1 2 0 1];

MAB1 = cat(1,A1,B1)

horzcat(A1,C1)
vertcat(B1,A1)


A1 = [2 0 -1;
      1 3 2];

A2 = [1 2 3;
      4 5 6]

A3 = [1 2;
    3 4
    5 6]

A4 = [1 2 3;
    3 4 5
    5 6 7]

A1 + A2
A1 - A2
A1 * A3


A1 .* A2
A1 ./ A2


exp(3)
log(3)
log10(3)
sqrt(4)
sin(pi/3)
cos(60)
tan(1)
asin(1)
acos(1)
atan(1)
mode(10,3)
%以下是对矩阵的每列取最小、最大、均值、中值、求和、连乘、累积总和、累积连乘
min(A1)
max(A1)
mean(A1)
median(A1)
sum(A1)
prod(A1)
cumsum(A1)
cumprod(A1)
diff([1 2 4 9 10])

fft([1 2 4 9 10])
rank([1 2 4 9 10])

%矩阵的转置
A'

logspace(1,2,10)
linspace(1,2,10)

 M = 4
 N = 5
for i = 1:M
    for j = 1:N
        X(i,j) = (i-1)*N + j;
    end
end

diff(X)

det(A1*A1')

[m,n] = find(A == 3)

a = [1,2,3.0,3,5,0,0,9]
a(find(a ~= 0))
