% https://codeantenna.com/a/DMj34DPq5o

clear;
clc;
close all;

t=-1:0.001:1;
f=1;
figure(1);
y=cos(2*pi*2*f*t);
subplot(1,2,1);plot(t,y);
y=sin(2*pi*2*f*t);
subplot(1,2,2);plot(t,y);


% 输入信号
figure(2);
subplot(4,1,1);
t=0:0.001:8;
d=[0 0; 0.5 1; 1 1; 1.5 0; 2 1; 2.5 1; 3 0; 3.5 0; 4 0; 4.5 1; 5 1; 5.5 0; 6 1; 6.5 1; 7 0; 7.5 0];
s=pulstran(t-0.25,d,'rectpuls',0.5);plot(t,s) ;
axis([0 8 -0.5 1.5]);
text(0.25,1.2,'0') ; text(0.75,1.2,'1') ; text(1.25,1.2,'1') ; text(1.75,1.2,'0') ;
text(2.25,1.2,'1') ; text(2.75,1.2,'1') ; text(3.25,1.2,'0') ; text(3.75,1.2,'0') ;
text(4.25,1.2,'0') ; text(4.75,1.2,'1') ; text(5.25,1.2,'1') ; text(5.75,1.2,'0') ;
text(6.25,1.2,'1') ; text(6.75,1.2,'1') ; text(7.25,1.2,'0') ; text(7.75,1.2,'0') ;


% I 路信号
 
subplot(4,1,2);
t1=0:0.001:8;
a1=1/sqrt(2);
d1=[0 -a1 ;1 +a1; 2 -a1; 3 +a1; 4 -a1 ;5 +a1;6 -a1;7 +a1];
s1=pulstran(t1-0.5,d1,'rectpuls');
plot(t1,s1) ;
axis([0 8 -2 2]);
text(0.5,1.5,'-0.7') ; text(1.5,1.5,'+0.7') ;text(2.5,1.5,'-0.7') ;text(3.5,1.5,'+0.7');
text(4.5,1.5,'-0.7') ; text(5.5,1.5,'+0.7') ;text(6.5,1.5,'-0.7') ;text(7.5,1.5,'+0.7');

% Q 路信号
a2=1/sqrt(2);
subplot(4,1,3);
t2=0:0.001:8;
d2=[0 +a2; 1 -a2; 2 -a2; 3 +a2; 4 +a2; 5 -a2; 6 -a2; 7 +a2];
s2=pulstran(t2-0.5, d2, 'rectpuls');
plot(t2,s2) ;
axis([0 8 -2 2]);
text(0.5,1.5,'+0.7') ; text(1.5,1.5,'-0.7') ; text(2.5,1.5,'-0.7') ; text(3.5,1.5,'+0.7')
text(4.5,1.5,'+0.7') ; text(5.5,1.5,'-0.7') ; text(6.5,1.5,'-0.7') ; text(7.5,1.5,'+0.7')



%QPSK 调制信号
a3 = 1/sqrt(2);
subplot(4,1,4);
t3 = 0:0.001:8;
d3 = [0 -a3 ; 1 +a3; 2 -a3; 3 +a3; 4 -a3 ; 5 +a3; 6 -a3; 7 +a3];
s3 = pulstran(t3-0.5,d3,'rectpuls').*cos(2*pi*5*t3) ;
d4 = [0 +a3; 1 -a3; 2 -a3; 3 +a3; 4 +a3; 5 -a3; 6 -a3; 7 +a3];
s4=pulstran(t3-0.5,d4,'rectpuls').*sin(2*pi*5*t3);
plot(t3,s3-s4) ;
axis([0 8 -2 2]);
text(0.3,1.5,'3\pi/4') ; text(1.3,1.5, '7\pi/4') ; text(2.3,1.5,'5\pi/4') ; text(3.3,1.5,'\pi/4') ;
text(4.3,1.5, '3\pi/4') ; text(5.3,1.5, '7\pi/4') ; text(6.3,1.5,'5\pi/4') ; text(7.3,1.5,'\pi/4') ;



