clear;clc;close all
%==========================================================================
%参数设置
%==========================================================================
c=3*1e8;                 %光速
Fs=30e6;                 %采样率

fL=26e9;                %最低频率
fH=28.35e9;             %最高频率
f0=(fL+fH)/2;           %中心频率
fc=28.35*1e9;           %载波频率


seta=0.52;               %俯仰角
fai =0.52;               %方位角
%==========================================================================
%模拟子阵的平均阵列坐标
%==========================================================================
load C:\GZHJXM\七波束测角\recv_array_axis_proc.mat PartArrayAxis DigSubArrayNum AxisMax;
[~,ArrayLocal] = diff_sub_array_axis_extract(PartArrayAxis,DigSubArrayNum); %模拟子阵坐标
%==========================================================================
%======       计算入射方向对应方向余弦
%==========================================================================
ulocal    = cosd(seta)*sind(fai);       
vlocal    = sind(seta);
real_vect =[ulocal,vlocal];

%==========================================================================
%信号参数设置
%==========================================================================
Rb = 1e6;                   %信息速率
Rs = 1.277*Rb;              %编码后速率,1277000
Fs=30e6;                    %采样率
iFs = ceil(Fs/Rs)*Rs;       %计算大于采样率的，最近的采样率,30648000

qint = round(iFs*1e-3);         %内插点数,30648
pdec = round(Fs*1e-3) ;         %抽取点数,30000

ModFact = 0.7;                           %调制指数
SampSym = round(iFs/Rs);                 %内插点数,24
SampTime = 1e-3;                         %采样时间
fd = 0.01e6;                             %基带频率
Nsamp = round(SampTime*Fs);              %采样点数,30000
SymLen = ceil((iFs/Fs)*Nsamp/SampSym)+1; %符号长度,1279
%==========================================================================
%信号导向矢量计算，增益计算
%==========================================================================
range_vec = real_vect';                                     %入射方向向量,(2,1)
sig_vect = exp(-1i*2*pi*fc*ArrayLocal*range_vec/c);         %构造中心频率处的导向矢量,(3328,1)
RealGain=10*log10(abs(sig_vect'*array_vect(:,1)).^2/abs(array_vect(:,1)'*array_vect(:,1)));%方向图增益
%==========================================================================
%信噪比设置
%==========================================================================           
snr=100;        %信噪比
%==========================================================================
%基带测控信号产生
%==========================================================================
tt = (0: SymLen*SampSym - 1) / iFs;    %时间变化范围,(1,30696)
x_bit = randi([0 1], SymLen, 1);       %产生0，1随机数,(1279,1)
x = 2*x_bit-1;                         %产生-1，1随机数,(1279,1)
qt = 0.5*Rs*(0:SampSym-1)/iFs;         %相位函数,(1,24)
rep_qt = repmat(qt,1,SymLen);          %相位函数拓展,(1,30696)
xcum = cumsum([0;x(1:end-1)]);         %符号累积,(1279,1)
xbold = rectpulse(xcum,SampSym)';      %矩形成型因子,(1,30696)
xbnew = rectpulse(x,SampSym)';         %矩形成型因子,(1,30696)
phase = pi*ModFact*xbold+ 2*pi*ModFact*xbnew.*rep_qt; %计算相位,(1,30696)
iFm = cos(2*pi*fc*tt+phase) + 1i*sin(2*pi*fc*tt+phase);  %,(1,30696)
yfm = resample(iFm,pdec,qint);    %,(1,30047)
%==========================================================================
%产生阵列信号
%==========================================================================
Ps = mean(abs(yfm).^2);  %计算信号能量,(1,1)
A = (10^(snr/20))/sqrt(Ps);  %, (1,1)
xsin  = A* yfm(1:Nsamp);    %,(1,30000)          %生成信号
%==========================================================================
%产生阵列信号
%==========================================================================
noise=(randn(M,Nsamp)+1i*randn(M,Nsamp))/sqrt(2);    %生成噪声,(3328,30000)
yarray =(sig_vect * xsin + noise);                   %生成阵列信号,(3328,30000)
%==========================================================================
%窄带波束形成
%==========================================================================
dbf_out = zeros(BeamNum,Nsamp);  %,(7,30000)
dbf_amp = zeros(BeamNum,1);      %,(7,1)
for bn=1:BeamNum
    dbf_out(bn,:) = array_vect(:,bn)'* yarray;   %,(7,30000)
    dbf_amp(bn,1) = mean(abs(dbf_out(bn,:)));    %,(7,1)
end;